
<details>
<summary>Home Work 30.03.2019</summary>

**Задание №1. Переменные**<br />
1.Создайте переменную x1 целочисленного типа int;
2. Проинициализируйте переменную x1 любым возможным значением для ее типа;
3. Выведите значение переменной x1 в консоль при помощи Console.WriteLine().

**Задание №2. Переменные**
1. Создайте переменную строчного типа str1;
2. Выведите на консоль сообщение: "Ваше имя?";
3. Считайте с консоли текст, который введет пользователь, и сохраните в переменную str1при помощи Console.ReadLine():
str1 = Console.ReadLine();
4. Создайте переменную строчного типа str2 и проинициализируйте ее значением:"Привет" + str1;
5. Выведите значение переменной str2 в консоль.

**Задание №3. Переменные**<br />
1.Создайте переменную v1 с неявной типизацией и проинициализируйте ее символьным значением: 'v';
2. Измените значение переменной v1 на любое другое;
3. Выведите значение переменной v1 в консоль.

**Задание №4. Операции**<br />
Дана сторона квадрата x. Найдите его периметр: P = 4 * x.
Примечание: Для считывания с консоли числа можно использовать методы класса Convert, либо метод Parse в классах, которые представляют системные типы:
Console.WriteLine("Введите длину стороны квадрата:");
stringstr = Console.ReadLine();
intx1 = Convert.ToInt32(str); // Первый вариант преобразования строки в число
intx2 = Int32.Parse(str); // Второй вариант преобразования строки в число
Подобным способом можно преобразовывать одни типы данных в другие.

**Задание №5. Операции**<br />
Даны два круга с общим центром и радиусами R1 и R2, уже известно, что R1>R2 (в программе это проверять не нужно).
Найдите площади этих кругов S1 и S2, а также площадь S3 кольца, внешний радиус которого равен R1, а внутренний радиус равен R2:
S1 = π * R1* R1;
S2 = π * R2* R2;
S3 = S1 − S2.
В качестве значения π используйте 3.14.

**Задание №6. Операции**<br />
Дано двузначное число. Выведите на консоль вначале его левую цифру (десятки), а затем – его правую цифру (единицы). Для нахождения десятков использовать операцию деления нацело, для нахождения единиц – операцию взятия остатка от деления.

**Задание №7. Преобразования базовых типов данных**<br />
1.Создайте две переменные типа int и проинициализируйте любыми значениями;
2. Создайте переменную типа long и сохраните в нее сумму двух ранее созданных переменных, выведите результат в консоль.

**Задание №8. Преобразования базовых типов данных**<br />
1. Создайте две переменные типа long и проинициализируйте любыми значениями;
2. Создайте переменную типа byte и сохраните в нее произведение двух ранее созданных переменных, выведите результат в консоль.

**Задание №9.**<br />
Даны две целые переменные a, b. Составить фрагмент программы, после исполнения которого значения переменных поменялись бы местами.
Решить двумя способами.
</details>

<details>
<summary>Home Work 06.04.2019</summary>
Почитать теорема де Моргана<br />
1. Напишите программу расчета факториала используя цикл.
 
2. Используя циклы и метод: Console.Write("*"), Console.Write(" "), Console.Write("\n") (для перехода на новую строку). Выведите на экран:
·          строку
·          прямоугольник
·          прямоугольный треугольник
·          равносторонний треугольник
·          ромб
Размер фигур задаем с консоли.
Сделать вариант как с заполненными фигурами так и только рамки.
 
3. Напишите метод, который будет определять: 1) является ли введенное число положительным или отрицательным. 2) Является ли оно простым (используйте технику перебора значений). (Простое число — это натуральное число, которое делится на 1 и само на себя. Чтобы определить простое число или нет, следует найти все его целые делители. Если делителей больше 2-х, значит оно не простое.) 3) Делится ли на 2, 5, 3, 6, 9 без остатка.

4. Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует возможных маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина?  
Используя Visual Studio, создайте проект по шаблону Console Application.  
Напишите программу, которая будет рассчитывать, и выводить на экран количество возможных вариантов доставки товара. Для решения задачи, используйте факториал N!, рассчитываемый с помощью цикла do-while. 

5. Дано два числа A и B (A<B) выведите сумму всех чисел расположенных между данными числами на экран. 
Дано два числа A и B (A<B) выведите все нечетные значения, расположенные между данными числами. 

6. Дано натуральное число. Определить количество четных цифр в нем. 

7.  Найти среднее арифметическое всех целых чисел от а до b (значения а и b вводятся с клавиатуры (b>=a)

8. Начав тренировки, лыжник в первый день пробежал 10 км. Каждый следующий день он увеличивал пробег на 10% от пробега предыдущего дня. Определить в какой день суммарный пробег за все дни превысит 100 км.

9. Напишите программу, которая вводит два целых числа и находит их произведение, не используя операцию умножения. Учтите, что числа могут быть отрицательными.

10. Выведите все квадраты натуральных чисел, не превосходящие данного числа N.

11. Дано число k. Напишите программу, которая выводит все числа Фибоначчи, которые не превышают его.

12. Дано число k. Напишите программу, которая выводит k первых чисел Фибоначчи.

13. Вводится число. Преобразовать его в другое число, цифры которого будут следовать в обратном порядке по сравнению с введенным числом (переворот числа).

14. Определить из каких цифр состоит число (вводится число, нужно его распарсить и вывести по порядку все цифры, в него входящие).

15. Возвести число k в степень n.

16. Из натурального числа удалить заданную цифру. Число и цифру вводить с клавиатуры. Например, задано число 5683. Требуется удалить из него цифру 8. Получится число 563.

17. Дано целое число, состоящее из разных цифр. Определить, какая из цифр заданного числа больше, т. е. найти наибольшую цифру числа.

18. Проверка гипотезы Сиракуз. Возьмем любое натуральное число. Если оно четное - разделим его пополам, если нечетное - умножим на 3, прибавим 1 и разделим пополам. Повторим эти действия с вновь полученным числом. Гипотеза гласит, что независимо от выбора первого числа рано или поздно мы получим 1.

19. Отгадать целое число, которое "загадал" компьютер в определенном диапазоне.
Для генерации произвольного числа используем new Random().Next(). Вводя число в консоли, программа должна указывать больше загаданное число введенного или меньше. С каждой итерацией мы должны приближаться к разгадке загаданного числа и в конце-концов угадать.

20. Найти сумму n-го количества элементов ряда:
S = 1/2 - 2/4 + 3/8 - 4/16 + ... - ...
</details>
